Practical 9
Aim – Simulating VRF.
R1
Router>enable
Router#conf t
Router(config)#hostname R1
R1(config)# interface loopback 0
R1(config-if)#ip address 1.1.1.1 255.255.255.255
R1(config-if)#exit
R1(config)#int e0/0
R1(config-if)#ip address 10.0.0.1 255.255.255.0
R1(config-if)#no shut
R1(config)#int e0/1
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shut
R1(config)#router ospf 1
R1(config-router)#network 1.1.1.0 0.0.0.255 area 0
R1(config-router)#network 10.0.0.0 0.0.0.255 area 0 R1(config-router)#exit
R1(config)#mpls label range 100 199
R1(config)#mpls label protocol ldp
R1(config)#mpls ldp router-id loopback 0
R1(config)#int e0/0
R1(config-if)#mpls ip
R1(config)#ip vrf A-1
R1(config-vrf)#rd 500:1
R1(config-vrf)#route-target import 500:1
R1(config-vrf)#route-target export 500:1
R1(config-vrf)#exit
R1(config)#exit
R1#sh ip vrf Name Default RD Interfaces A-1 500:1 R1#sh ip vrf detail VRF A-1 (VRF Id = 1);
default RD 500:1;
default VPNID Old CLI format, supports IPv4 only Flags: 0xC No interfaces Address family ipv4 unicast (Table ID = 0x1): Flags: 0x0 Export VPN route-target communities RT:500:1 Import VPN route-target communities RT:500:1 No import route-map No global export route-map No export route-map VRF label distribution protocol: not configured VRF label allocation mode: per-prefix
R1(config)#int e0/1
R1(config-if)#ip vrf forwarding A-1 % Interface Ethernet0/1 IPv4 disabled and address(es) removed due to enabling VRF A-1 R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#end
R1#sh ip route vrf A-1
Routing Table: A-1 Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS
summary,
L1 - IS-IS level-1, L2 - IS-IS level-2 ia - IS-IS inter area, * - candidate default, U - per-user static route o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP a - application route + - replicated route, % - next hop override
Gateway of last resort is not set
192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.1.0/24 is directly connected, Ethernet0/1
L 192.168.1.1/32 is directly connected, Ethernet0/1
R1#sh ip vrf Name Default RD Interfaces A-1 500:1 Et0/1
R1(config)#router ospf 10 vrf A-1
R1(config-router)#network 192.168.1.0 0.0.0.255 area 10
R1(config-router)#end
R1#sh ip ospf neighbor Neighbor ID Pri State Dead Time Address In
terface 2.2.2.2 1 FULL/DR 00:00:39 10.0.0.2 Ethernet0/0 4.4.4.4 1 FULL/DR 00:00:38 192.168.1.4 Ethernet0/1 R1#sh ip ospf 10 neighbor Neighbor ID Pri State Dead Time Address Interface 4.4.4.4 1 FULL/DR 00:00:38 192.168.1.4 Ethernet0/1
R1#sh ip route vrf A-1 ospf
Routing Table: A-1 Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS
summary,
L1 - IS-IS level-1,
L2 - IS-IS level-2 ia - IS-IS inter area,
* - candidate default,
U - per-user static route o – ODR
, P - periodic downloaded static route, H - NHRP,
l - LISP a - application route + - replicated route,
% - next hop override Gateway of last resort is not set 4.0.0.0/32 is subnetted, 1 subnets O 4.4.4.4 [110/11] via 192.168.1.4, 00:03:58, Ethernet0/1 R1(config)#router bgp 500
R1(config-router)#no bgp default ipv4-unicast
R1(config-router)#neighbor 3.3.3.3 remote-as 500
R1(config-router)#neighbor 3.3.3.3 update-source loopback 0
R1(config-router)#address-family vpnv4 unicast
R1(config-router-af)#neighbor 3.3.3.3 activate R1(config-router-af)#neighbor 3.3.3.3 send-community extended R1(config-router-af)#neighbor 3.3.3.3 next-hop-self R1(config-router-af)#end
R1#sh ip bgp vpnv4 all summary
BGP router identifier 1.1.1.1, local AS number 500 BGP table version is 1, main routing table version 1 Neighbor V AS MsgRcvd MsgSent TblVer InQ OutQ Up/Down State/PfxRcd 3.3.3.3 4 500 6 7 1 0 0 00:03:19 0
R1(config)#router bgp 500
R1(config-router)#address-family ipv4 vrf A-1
R1(config-router-af)#redistribute ospf 10 vrf A-1 match internal external 1 external 2
R1(config-router-af)#exit R1(config-router)#exit
R1(config)#router ospf 10 vrf A-1
R1(config-router)#redistribute bgp 500 subnets
R1(config-router)#end R1#sh ip bgp vpnv4 all BGP table version is 7, local router ID is 1.1.1.1 Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, x best-external, a additional-path, c RIB-compressed, Origin codes: i - IGP, e - EGP, ? - incomplete RPKI validation codes: V valid, I invalid, N Not found
Network           Next Hop   Metric  LocPrf Weight Path Route Distinguisher: 500:1 (default for vrf A-1)
*> 4.4.4.4/32    192.168.1.4  11                                     32768 ?
*>i 5.5.5.5/32   3.3.3.3 11      100                                     0 ?
*> 192.168.1.   0 0.0.0.0         0                                    32768 ?
*>i 192.168.2.0  3.3.3.3            0                                         100 0 ?
R1#sh ip route vrf A-1
Routing Table: A-1 Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS
summary,
L1 - IS-IS level-1, L2 - IS-IS level-2 ia - IS-IS inter area, * - candidate default, U - per-user static route o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP a - application route + - replicated route, % - next hop override
Gateway of last resort is not set
4.0.0.0/32 is subnetted, 1 subnets O 4.4.4.4 [110/11] via 192.168.1.4, 07:36:09, Ethernet0/1 5.0.0.0/32 is subnetted, 1 subnets B 5.5.5.5 [200/11] via 3.3.3.3, 00:06:15 192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.1.0/24 is directly connected, Ethernet0/1 L 192.168.1.1/32 is directly connected, Ethernet0/1 B 192.168.2.0/24 [200/0] via 3.3.3.3, 00:06:15
R1#sh ip route vrf A-1 bgp
Routing Table: A-1 Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2 ia - IS-IS inter area, * - candidate default, U - per-user static route o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP a - application route + - replicated route, % - next hop override
Gateway of last resort is not set 5.0.0.0/32 is subnetted, 1 subnets B 5.5.5.5 [200/11] via 3.3.3.3, 00:07:31 B 192.168.2.0/24 [200/0] via 3.3.3.3, 00:07:31
R1#ping vrf A-1 4.4.4.4
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 4.4.4.4, timeout is 2 seconds: !!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/2/6 ms
R2
Router>enable
Router#conf t
Router(config)#hostname R2
R2(config)# interface loopback 0
R2(config-if)#ip address 2.2.2.2 255.255.255.255
R2(config-if)# exit
R2(config)#int e0/0
R2(config-if)#ip address 10.0.0.2 255.255.255.0
R2(config-if)#no shut
R2(config)#int e0/1
R2(config-if)#ip address 10.0.1.2 255.255.255.0
R2(config-if)#no shut
R2(config)#router ospf 1
R2(config-router)#network 2.2.2.0 0.0.0.255 area 0
R2(config-router)#network 10.0.0.0 0.0.0.255 area 0
R2(config-router)#network 10.0.1.0 0.0.0.255 area 0
R2(config-router)#exit
R2(config)#mpls label range 200 299 R2(config)#mpls label protocol ldp
R2(config)#mpls ldp router-id loopback 0
R2(config)#int e0/0 R2(config-if)#mpls ip
R2(config-if)#int e0/1
R2(config-if)#mpls ip
R3
Router>enable
Router#conf t
Router(config)#hostname
R3
R3(config)#interface loopback 0
R3(config-if)#ip address 3.3.3.3 255.255.255.255
R3(config-if)#exit
R3(config)#int e0/0
R3(config-if)#ip address 10.0.1.3 255.255.255.0
R3(config-if)#no shut
R3(config-if)#exit
R3(config)#interface e0/1
R3(config-if)#ip address 192.168.2.3 255.255.255.0
R3(config-if)#no shut
R3(config-if)#exit
R3(config)#router ospf 1
R3(config-router)#network 3.3.3.0 0.0.0.255 area 0
R3(config-router)#network 10.0.1.0 0.0.0.255 area 0
R3(config-router)#exit
R3(config)#mpls label range 300 399
R3(config)#mpls label protocol ldp
R3(config)#mpls ldp router-id loopback 0
R3(config)#int e0/0
R3(config-if)#mpls ip
R3(config)#ip vrf A-2
R3(config-vrf)#rd 500:1
R3(config-vrf)#route-target import 500:1
R3(config-vrf)#route-target export 500:1
R3#sh ip vrf Name Default RD Interfaces A-2 500:1
R3#sh ip vrf detail
VRF A-2 (VRF Id = 1);
default RD 500:1; default VPNID Old CLI format, supports IPv4 only Flags: 0xC No interfaces Address family ipv4 unicast (Table ID = 0x1): Flags: 0x0 Export VPN route-target communities RT:500:1 Import VPN route-target communities RT:500:1 No import route-map No global export route-map No export route-map VRF label distribution protocol: not configured VRF label allocation mode: per-prefix R3(config)#int e0/1 R3(config-if)#ip vrf forwarding A-2 % Interface Ethernet0/1 IPv4 disabled and address(es) removed due to enabling VRF A-2 R3(config-if)#ip address 192.168.2.3 255.255.255.0
R3(config-if)#end
R3#sh ip route vrf A-2 Routing Table: A-2
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2 ia - IS-IS inter area, * - candidate default, U - per-user static route o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP a - application route + - replicated route, % - next hop override
Gateway of last resort is not set
192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks C 192.168.2.0/24 is directly connected,
Ethernet0/1 L 192.168.2.3/32 is directly connected,
Ethernet0/1
R3#sh ip vrf Name Default RD Interfaces A-2 500:1 Et0/1
R3(config)#router ospf 10 vrf A-2
R3(config-router)#network 192.168.2.0 0.0.0.255 area 0 R3(config-router)#end R3#sh ip ospf 10 neighbor Neighbor ID Pri State Dead Time Address Interface 5.5.5.5 1 FULL/DR 00:00:33 192.168.2.5 Ethernet0/1
R3#sh ip route vrf A-2 ospf
Routing Table: A-2
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2 ia - IS-IS inter area, * - candidate default, U - per-user static route o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP a - application route + - replicated route, % - next hop override
Gateway of last resort is not set
5.0.0.0/32 is subnetted, 1 subnets O 5.5.5.5 [110/11] via 192.168.2.5, 00:06:37,
Ethernet0/1
R3(config)#router bgp 500
R3(config-router)#no bgp default ipv4-unicast R3(config-router)#neighbor 1.1.1.1 remote-as 500
R3(config-router)#neighbor 1.1.1.1 update-source loopback 0 R3(config-router)#address-family vpnv4 unicast
R3(config-router-af)#neighbor 1.1.1.1 activate
R3(config-router-af)#neighbor 1.1.1.1 send-community extended
R3(config-router-af)#neighbor 1.1.1.1 next-hop-self
R3#sh ip bgp vpnv4 all
summary
BGP router identifier 3.3.3.3, local AS number 500 BGP table version is 1, main routing table version 1 Neighbor V AS MsgRcvd MsgSent TblVer InQ OutQ Up/Down State/PfxRcd 1.1.1.1 4 500 7 6 1 0 0 00:03:01
R3(config)#router bgp 500
R3(config-router)#address-family ipv4 vrf A-2
R3(config-router-af)#redistribute ospf 10 vrf A-2 match internal external 1 external 2
R3(config-router-af)#exit R
3(config-router)#exit
R3(config)#router ospf 10 vrf A-2
R3(config-router)#redistribute bgp 500 subnets
R3(config-router)#end
R3#sh ip bgp vpnv4 all
BGP table version is 7, local router ID is 3.3.3.3
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, x best-external, a additional-path, c RIB-compressed, Origin codes: i - IGP, e - EGP, ? - incomplete RPKI validation codes: V valid, I invalid, N Not found
Network           Next Hop    Metric   LocPrf Weight Path Route Distinguisher: 500:1 (default for vrf A-2)
*>i 4.4.4.4/32    1.1.1.1             11                           100 0 ?
*> 5.5.5.5/32   192.168.2.5      11                               32768 ?
*>i 192.168.1.0  1.1.1.1               0                              100 0 ?
*> 192.168.2.0       0.0.0.0          0                               32768 ?
R3#sh ip route vrf A-2
Routing Table: A-2
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2 ia - IS-IS inter area, * - candidate default, U - per-user static route o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP a - application route + - replicated route, % - next hop override
Gateway of last resort is not set
4.0.0.0/32 is subnetted, 1 subnets B 4.4.4.4 [200/11] via 1.1.1.1, 00:55:23 5.0.0.0/32 is subnetted, 1 subnets O 5.5.5.5 [110/11] via 192.168.2.5, 01:50:21,
Ethernet0/1 B 192.168.1.0/24 [200/0] via 1.1.1.1, 00:55:23 192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks C 192.168.2.0/24 is directly connected,
Ethernet0/1 L 192.168.2.3/32 is directly connected, Ethernet0/1 R3#ping vrf A-2 5.5.5.5 T
ype escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 5.5.5.5, timeout is 2 seconds: !!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
R4 Router>enable
Router#conf t
Router(config)#hostname R4
R4(config)#int loopback 0
R4(config-if)#ip address 4.4.4.4 255.255.255.255
R4(config-if)#exit
R4(config)#int e0/0
R4(config-if)#ip address 192.168.1.4 255.255.255.0
R4(config-if)#no shutdown
R4(config-if)#exit
R4(config)#router ospf 1
R4(config-router)#network 4.4.4.0 0.0.0.255 area 10
R4(config-router)#network 192.168.1.0 0.0.0.255 area 10
R4(config-router)#exit
R4#sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2 ia - IS-IS inter area, * - candidate default, U - per-user static route o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP a - application route + - replicated route, % - next hop override
Gateway of last resort is not set
5.0.0.0/32 is subnetted, 1 subnets O IA 5.5.5.5 [110/21] via 192.168.1.1, 00:23:41,
Ethernet0/0 O IA 192.168.2.0/24 [110/11] via 192.168.1.1, 00:23:41,
Ethernet0/0 R4#ping 5.5.5.5 source lo 0
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 5.5.5.5, timeout is 2 seconds:
Packet sent with a source address of 4.4.4.4 !!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/2 ms R5
Router>enable
Router#conf t
Router(config)#hostname R5
R5(config)#int loopback 0
R5(config-if)#ip address 5.5.5.5 255.255.255.255
R5(config-if)#exit
R5(config)#int e0/0
R5(config-if)#ip address 192.168.2.5 255.255.255.
R5(config-if)#no shutdown
R5(config-if)#exit
R5(config)#router ospf 1
R5(config-router)#network 5.5.5.0 0.0.0.255 area 0
R5(config-router)#network 192.168.2.0 0.0.0.255 area 0 R5(config-router)#exit
R5#sh ip route ospf Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2 E1 - OSPF external type 1, E2 - OSPF external type 2 i - IS-IS, su - IS-IS
summary, L1 - IS-IS level-1, L2 - IS-IS level-2 ia - IS-IS inter area, * - candidate default, U - per-user static route o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP a - application route + - replicated route, % - next hop override
Gateway of last resort is not set 4.0.0.0/32 is subnetted, 1 subnets O IA 4.4.4.4 [110/21] via 192.168.2.3, 00:23:51, Ethernet0/0 O IA 192.168.1.0/24 [110/11] via 192.168.2.3, 00:23:51, Ethernet0/0
R5#ping 4.4.4.4 source lo 0
Type escape sequence to abort. Sending 5, 100-byte ICMP Echos to 4.4.4.4, timeout is 2 seconds: Packet sent with a source address of 5.5.5.5 !!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 2/2/3 ms




